fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <posting>Deny</posting>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Объект.Год = НачалоГода(Объект.Год);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДнейОтпуска = 0; 
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДнейОтпуска = 0;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДнейОтпуска = 0;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
	Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диаграмма(Команда)
	
	СписокОтпусковСотрудников = Новый Массив;
	СписокОтпусковИГод = Новый Структура("СписокОтпусковСотрудников, Год", СписокОтпусковСотрудников, Объект.Год);
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		СтруктураДанных = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
		СтруктураДанных.Сотрудник = Строка.Сотрудник;
		СтруктураДанных.ДатаНачала = Строка.ДатаНачала;
		СтруктураДанных.ДатаОкончания = Строка.ДатаОкончания;
		СписокОтпусковСотрудников.Добавить(СтруктураДанных);
	КонецЦикла;
	
	АдресДанных = ПоместитьВоВременноеХранилище(СписокОтпусковИГод);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодсчетДнейОтпуска(Сотрудник)
	
	Отбор = Новый Структура("Сотрудник", Сотрудник);
	
	СписокСтрокСотрудника = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);
	
	ВсегоДнейОтпуска = 0;
	
	Для Каждого Строка Из СписокСтрокСотрудника Цикл
		ВсегоДнейОтпуска = ВсегоДнейОтпуска + Цел(((Строка.ДатаОкончания + 86400) - Строка.ДатаНачала) / 86400);
	КонецЦикла;
	
	Для Каждого Строка Из СписокСтрокСотрудника Цикл
		Строка.ДнейОтпуска = ВсегоДнейОтпуска;
	КонецЦикла;
	
	Если ВсегоДнейОтпуска > 28 Тогда
		ТекстСообщения = СтрШаблон("Общее количество дней отпуска для сотрудника %1 превышает 28", Сотрудник);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
